https://github.com/microsoft/recommenders/blob/main/examples/00_quick_start/als_movielens.ipynb

In [ ]:
!pip install pyspark==3.4.0

In [ ]:
!pip install recommenders==1.1.1

In [ ]:
!pip install pysqldf

# path

In [63]:
%run ./path.ipynb

# packages

In [65]:
%run ./setting.ipynb

# load data

In [45]:
ratings = pd.read_csv(
    "https://raw.githubusercontent.com/khanhnamle1994/movielens/master/ratings.csv",
    delimiter = '\t',
    )

ratings['timestamp'] = pd.to_datetime(
    ratings['timestamp'],
    unit='s',
    )

ratings['timestamp'] = ratings['timestamp'].astype('str')

In [50]:
ratings_date = sql(f"""
select *, 
substr(timestamp, 1, 9) as date
from ratings
""")

In [55]:
ratings_date.head(10)

,Unnamed: 0,user_id,movie_id,rating,timestamp,user_emb_id,movie_emb_id,date
0,0,1,1193,5,2000-12-31 22:12:40,0,1192,2000-12-3
1,1,1,661,3,2000-12-31 22:35:09,0,660,2000-12-3
2,2,1,914,3,2000-12-31 22:32:48,0,913,2000-12-3
3,3,1,3408,4,2000-12-31 22:04:35,0,3407,2000-12-3
4,4,1,2355,5,2001-01-06 23:38:11,0,2354,2001-01-0
5,5,1,1197,3,2000-12-31 22:37:48,0,1196,2000-12-3
6,6,1,1287,5,2000-12-31 22:33:59,0,1286,2000-12-3
7,7,1,2804,5,2000-12-31 22:11:59,0,2803,2000-12-3
8,8,1,594,4,2000-12-31 22:37:48,0,593,2000-12-3
9,9,1,919,4,2000-12-31 22:22:48,0,918,2000-12-3

In [58]:
sql(f"""
select 
count(*),
count(distinct user_id || movie_id || date),
count(distinct user_id),
count(distinct movie_id),
count(distinct date)
from ratings_date
""")

,count(*),count(distinct user_id || movie_id || date),count(distinct user_id),count(distinct movie_id),count(distinct date)
0,1000209,1000184,6040,3706,135

# save to parquet

In [64]:
ratings_date.to_parquet(
    os.path.join(
        data_path,
        ratings_with_date,
    )
    )

# end